GOLDEN_OUTPUT = """osd.31:
  op_r lat (μsec): min=62, max=7089, avg=461.97, stdev=565.84, samples=4945
  lat percentiles (μsec):
  |   1.00th=[  74.00],  5.00th=[  88.00], 10.00th=[ 102.00],
  |  20.00th=[ 147.00], 30.00th=[ 230.00], 40.00th=[ 247.00],
  |  50.00th=[ 264.00], 60.00th=[ 292.00], 70.00th=[ 346.00],
  |  80.00th=[ 639.00], 90.00th=[1096.00], 95.00th=[1465.00],
  |  99.00th=[2850.00], 99.50th=[3762.00], 99.90th=[5205.00]

  op_w lat (μsec): min=534, max=59719, avg=2016.46, stdev=2398.03, samples=17553
  lat percentiles (μsec):
  |   1.00th=[  670.00],  5.00th=[  757.00], 10.00th=[  818.00],
  |  20.00th=[  905.00], 30.00th=[  980.00], 40.00th=[ 1063.00],
  |  50.00th=[ 1172.00], 60.00th=[ 1326.00], 70.00th=[ 1599.00],
  |  80.00th=[ 2309.00], 90.00th=[ 4263.00], 95.00th=[ 6402.00],
  |  99.00th=[12615.00], 99.50th=[15862.00], 99.90th=[19745.00]

  subop_w lat (μsec): min=200, max=21635, avg=751.60, stdev=1331.56, samples=32665
  lat percentiles (μsec):
  |   1.00th=[  268.00],  5.00th=[  292.00], 10.00th=[  308.00],
  |  20.00th=[  332.00], 30.00th=[  355.00], 40.00th=[  381.00],
  |  50.00th=[  412.00], 60.00th=[  454.00], 70.00th=[  514.00],
  |  80.00th=[  617.00], 90.00th=[ 1086.00], 95.00th=[ 2426.00],
  |  99.00th=[ 7820.00], 99.50th=[10115.00], 99.90th=[13783.00]

osd.6:
  op_r lat (μsec): min=62, max=27131, avg=434.17, stdev=850.61, samples=3298
  lat percentiles (μsec):
  |   1.00th=[  76.00],  5.00th=[  86.00], 10.00th=[  97.00],
  |  20.00th=[ 141.00], 30.00th=[ 235.00], 40.00th=[ 249.00],
  |  50.00th=[ 263.00], 60.00th=[ 280.00], 70.00th=[ 318.00],
  |  80.00th=[ 446.00], 90.00th=[ 988.00], 95.00th=[1238.00],
  |  99.00th=[2478.00], 99.50th=[4137.00], 99.90th=[8855.00]

  op_w lat (μsec): min=536, max=669993, avg=2326.90, stdev=10717.75, samples=13978
  lat percentiles (μsec):
  |   1.00th=[  652.00],  5.00th=[  739.00], 10.00th=[  796.00],
  |  20.00th=[  881.00], 30.00th=[  954.00], 40.00th=[ 1037.00],
  |  50.00th=[ 1137.00], 60.00th=[ 1287.00], 70.00th=[ 1580.00],
  |  80.00th=[ 2297.00], 90.00th=[ 4454.00], 95.00th=[ 7081.00],
  |  99.00th=[18779.00], 99.50th=[23384.00], 99.90th=[29571.00]

  subop_w lat (μsec): min=183, max=25210, avg=734.99, stdev=1183.87, samples=35912
  lat percentiles (μsec):
  |   1.00th=[  274.00],  5.00th=[  305.00], 10.00th=[  323.00],
  |  20.00th=[  352.00], 30.00th=[  378.00], 40.00th=[  406.00],
  |  50.00th=[  437.00], 60.00th=[  477.00], 70.00th=[  533.00],
  |  80.00th=[  639.00], 90.00th=[ 1061.00], 95.00th=[ 2201.00],
  |  99.00th=[ 7242.00], 99.50th=[ 9118.00], 99.90th=[12042.00]

osd.53:
  op_r lat (μsec): min=62, max=40024, avg=1441.31, stdev=4320.96, samples=780
  lat percentiles (μsec):
  |   1.00th=[   75.00],  5.00th=[   96.00], 10.00th=[  120.00],
  |  20.00th=[  248.00], 30.00th=[  270.00], 40.00th=[  288.00],
  |  50.00th=[  311.00], 60.00th=[  347.00], 70.00th=[  397.00],
  |  80.00th=[  717.00], 90.00th=[ 1572.00], 95.00th=[ 9609.00],
  |  99.00th=[21547.00], 99.50th=[32178.00], 99.90th=[40024.00]

  op_w lat (μsec): min=854, max=67195, avg=2510.02, stdev=2474.26, samples=1419
  lat percentiles (μsec):
  |   1.00th=[  943.00],  5.00th=[ 1066.00], 10.00th=[ 1150.00],
  |  20.00th=[ 1284.00], 30.00th=[ 1390.00], 40.00th=[ 1531.00],
  |  50.00th=[ 1722.00], 60.00th=[ 2043.00], 70.00th=[ 2567.00],
  |  80.00th=[ 3622.00], 90.00th=[ 5067.00], 95.00th=[ 5794.00],
  |  99.00th=[ 7229.00], 99.50th=[10420.00], 99.90th=[21448.00]

  subop_w lat (μsec): min=266, max=15528, avg=881.15, stdev=802.36, samples=3193
  lat percentiles (μsec):
  |   1.00th=[ 398.00],  5.00th=[ 457.00], 10.00th=[ 490.00],
  |  20.00th=[ 535.00], 30.00th=[ 580.00], 40.00th=[ 623.00],
  |  50.00th=[ 672.00], 60.00th=[ 734.00], 70.00th=[ 811.00],
  |  80.00th=[ 947.00], 90.00th=[1323.00], 95.00th=[2001.00],
  |  99.00th=[4855.00], 99.50th=[5644.00], 99.90th=[7935.00]

osd.93:
  op_r lat (μsec): min=61, max=43990, avg=923.73, stdev=3000.79, samples=1008
  lat percentiles (μsec):
  |   1.00th=[   73.00],  5.00th=[  117.00], 10.00th=[  236.00],
  |  20.00th=[  259.00], 30.00th=[  275.00], 40.00th=[  286.00],
  |  50.00th=[  304.00], 60.00th=[  332.00], 70.00th=[  366.00],
  |  80.00th=[  444.00], 90.00th=[ 1235.00], 95.00th=[ 1943.00],
  |  99.00th=[16505.00], 99.50th=[21866.00], 99.90th=[25667.00]

  op_w lat (μsec): min=793, max=461976, avg=2620.76, stdev=10911.04, samples=1814
  lat percentiles (μsec):
  |   1.00th=[  956.00],  5.00th=[ 1125.00], 10.00th=[ 1224.00],
  |  20.00th=[ 1382.00], 30.00th=[ 1521.00], 40.00th=[ 1651.00],
  |  50.00th=[ 1827.00], 60.00th=[ 2096.00], 70.00th=[ 2572.00],
  |  80.00th=[ 3210.00], 90.00th=[ 4243.00], 95.00th=[ 4646.00],
  |  99.00th=[ 9315.00], 99.50th=[12543.00], 99.90th=[20935.00]

  subop_w lat (μsec): min=237, max=12141, avg=973.54, stdev=1040.15, samples=3658
  lat percentiles (μsec):
  |   1.00th=[  390.00],  5.00th=[  459.00], 10.00th=[  491.00],
  |  20.00th=[  547.00], 30.00th=[  600.00], 40.00th=[  654.00],
  |  50.00th=[  708.00], 60.00th=[  772.00], 70.00th=[  851.00],
  |  80.00th=[  997.00], 90.00th=[ 1446.00], 95.00th=[ 2559.00],
  |  99.00th=[ 6207.00], 99.50th=[ 8132.00], 99.90th=[11062.00]

osd.61:
  op_r lat (μsec): min=65, max=13859, avg=458.60, stdev=649.33, samples=1384
  lat percentiles (μsec):
  |   1.00th=[   80.00],  5.00th=[  109.00], 10.00th=[  224.00],
  |  20.00th=[  265.00], 30.00th=[  283.00], 40.00th=[  305.00],
  |  50.00th=[  329.00], 60.00th=[  354.00], 70.00th=[  375.00],
  |  80.00th=[  413.00], 90.00th=[  888.00], 95.00th=[ 1325.00],
  |  99.00th=[ 2224.00], 99.50th=[ 3396.00], 99.90th=[11292.00]

  op_w lat (μsec): min=837, max=583392, avg=2358.83, stdev=10996.74, samples=2856
  lat percentiles (μsec):
  |   1.00th=[  949.00],  5.00th=[ 1066.00], 10.00th=[ 1144.00],
  |  20.00th=[ 1277.00], 30.00th=[ 1394.00], 40.00th=[ 1501.00],
  |  50.00th=[ 1634.00], 60.00th=[ 1800.00], 70.00th=[ 2046.00],
  |  80.00th=[ 2636.00], 90.00th=[ 3863.00], 95.00th=[ 5159.00],
  |  99.00th=[ 7879.00], 99.50th=[ 8607.00], 99.90th=[20086.00]

  subop_w lat (μsec): min=274, max=12603, avg=1096.60, stdev=901.82, samples=1312
  lat percentiles (μsec):
  |   1.00th=[ 431.00],  5.00th=[ 501.00], 10.00th=[ 545.00],
  |  20.00th=[ 613.00], 30.00th=[ 677.00], 40.00th=[ 727.00],
  |  50.00th=[ 791.00], 60.00th=[ 886.00], 70.00th=[1038.00],
  |  80.00th=[1362.00], 90.00th=[2076.00], 95.00th=[2640.00],
  |  99.00th=[3740.00], 99.50th=[7169.00], 99.90th=[8431.00]

osd.150:
  op_r lat (μsec): min=57, max=370943, avg=6584.67, stdev=26096.72, samples=698
  lat percentiles (μsec):
  |   1.00th=[    72.00],  5.00th=[    88.00], 10.00th=[   112.00],
  |  20.00th=[   252.00], 30.00th=[   273.00], 40.00th=[   288.00],
  |  50.00th=[   309.00], 60.00th=[   334.00], 70.00th=[   379.00],
  |  80.00th=[   733.00], 90.00th=[ 15417.00], 95.00th=[ 41760.00],
  |  99.00th=[126908.00], 99.50th=[184253.00], 99.90th=[370943.00]

  op_w lat (μsec): min=886, max=1039793, avg=76598.94, stdev=161797.20, samples=1268
  lat percentiles (μsec):
  |   1.00th=[  1017.00],  5.00th=[  1199.00], 10.00th=[  1355.00],
  |  20.00th=[  1607.00], 30.00th=[  1832.00], 40.00th=[  2116.00],
  |  50.00th=[  2602.00], 60.00th=[  3422.00], 70.00th=[  6823.00],
  |  80.00th=[107723.00], 90.00th=[302258.00], 95.00th=[451508.00],
  |  99.00th=[650942.00], 99.50th=[884314.00], 99.90th=[941815.00]

  subop_w lat (μsec): min=243, max=163564, avg=2393.34, stdev=9196.40, samples=2972
  lat percentiles (μsec):
  |   1.00th=[   371.00],  5.00th=[   485.00], 10.00th=[   524.00],
  |  20.00th=[   586.00], 30.00th=[   633.00], 40.00th=[   687.00],
  |  50.00th=[   754.00], 60.00th=[   848.00], 70.00th=[   991.00],
  |  80.00th=[  1369.00], 90.00th=[  2859.00], 95.00th=[  6114.00],
  |  99.00th=[ 68003.00], 99.50th=[ 70133.00], 99.90th=[107652.00]

"""

GOLDEN_OUTPUT_OSD_6 = """osd.6:
  op_r lat (μsec): min=62, max=27131, avg=434.17, stdev=850.61, samples=3298
  lat percentiles (μsec):
  |   1.00th=[  76.00],  5.00th=[  86.00], 10.00th=[  97.00],
  |  20.00th=[ 141.00], 30.00th=[ 235.00], 40.00th=[ 249.00],
  |  50.00th=[ 263.00], 60.00th=[ 280.00], 70.00th=[ 318.00],
  |  80.00th=[ 446.00], 90.00th=[ 988.00], 95.00th=[1238.00],
  |  99.00th=[2478.00], 99.50th=[4137.00], 99.90th=[8855.00]

  op_w lat (μsec): min=536, max=669993, avg=2326.90, stdev=10717.75, samples=13978
  lat percentiles (μsec):
  |   1.00th=[  652.00],  5.00th=[  739.00], 10.00th=[  796.00],
  |  20.00th=[  881.00], 30.00th=[  954.00], 40.00th=[ 1037.00],
  |  50.00th=[ 1137.00], 60.00th=[ 1287.00], 70.00th=[ 1580.00],
  |  80.00th=[ 2297.00], 90.00th=[ 4454.00], 95.00th=[ 7081.00],
  |  99.00th=[18779.00], 99.50th=[23384.00], 99.90th=[29571.00]

  subop_w lat (μsec): min=183, max=25210, avg=734.99, stdev=1183.87, samples=35912
  lat percentiles (μsec):
  |   1.00th=[  274.00],  5.00th=[  305.00], 10.00th=[  323.00],
  |  20.00th=[  352.00], 30.00th=[  378.00], 40.00th=[  406.00],
  |  50.00th=[  437.00], 60.00th=[  477.00], 70.00th=[  533.00],
  |  80.00th=[  639.00], 90.00th=[ 1061.00], 95.00th=[ 2201.00],
  |  99.00th=[ 7242.00], 99.50th=[ 9118.00], 99.90th=[12042.00]

"""

GOLDEN_OUTPUT_OSD_6_IN_MS = """osd.6:
  op_r lat (msec): min=0.062, max=27.131, avg=0.43, stdev=0.85, samples=3298
  lat percentiles (msec):
  |   1.00th=[0.08],  5.00th=[0.09], 10.00th=[0.10],
  |  20.00th=[0.14], 30.00th=[0.23], 40.00th=[0.25],
  |  50.00th=[0.26], 60.00th=[0.28], 70.00th=[0.32],
  |  80.00th=[0.45], 90.00th=[0.99], 95.00th=[1.24],
  |  99.00th=[2.48], 99.50th=[4.14], 99.90th=[8.86]

  op_w lat (msec): min=0.536, max=669.993, avg=2.33, stdev=10.72, samples=13978
  lat percentiles (msec):
  |   1.00th=[ 0.65],  5.00th=[ 0.74], 10.00th=[ 0.80],
  |  20.00th=[ 0.88], 30.00th=[ 0.95], 40.00th=[ 1.04],
  |  50.00th=[ 1.14], 60.00th=[ 1.29], 70.00th=[ 1.58],
  |  80.00th=[ 2.30], 90.00th=[ 4.45], 95.00th=[ 7.08],
  |  99.00th=[18.78], 99.50th=[23.38], 99.90th=[29.57]

  subop_w lat (msec): min=0.183, max=25.21, avg=0.73, stdev=1.18, samples=35912
  lat percentiles (msec):
  |   1.00th=[ 0.27],  5.00th=[ 0.30], 10.00th=[ 0.32],
  |  20.00th=[ 0.35], 30.00th=[ 0.38], 40.00th=[ 0.41],
  |  50.00th=[ 0.44], 60.00th=[ 0.48], 70.00th=[ 0.53],
  |  80.00th=[ 0.64], 90.00th=[ 1.06], 95.00th=[ 2.20],
  |  99.00th=[ 7.24], 99.50th=[ 9.12], 99.90th=[12.04]

"""

GOLDEN_KV_COMMIT_OUTPUT = """osd.31:
  op_w kv_commit (μsec): min=93, max=3047, avg=160.90, stdev=92.86, samples=17553
  kv_commit percentiles (μsec):
  |   1.00th=[ 102.00],  5.00th=[ 108.00], 10.00th=[ 114.00],
  |  20.00th=[ 121.00], 30.00th=[ 127.00], 40.00th=[ 134.00],
  |  50.00th=[ 141.00], 60.00th=[ 149.00], 70.00th=[ 163.00],
  |  80.00th=[ 188.00], 90.00th=[ 229.00], 95.00th=[ 261.00],
  |  99.00th=[ 383.00], 99.50th=[ 451.00], 99.90th=[1813.00]

  subop_w kv_commit (μsec): min=90, max=3099, avg=161.87, stdev=78.54, samples=32665
  kv_commit percentiles (μsec):
  |   1.00th=[101.00],  5.00th=[109.00], 10.00th=[114.00],
  |  20.00th=[121.00], 30.00th=[128.00], 40.00th=[134.00],
  |  50.00th=[142.00], 60.00th=[152.00], 70.00th=[167.00],
  |  80.00th=[195.00], 90.00th=[233.00], 95.00th=[265.00],
  |  99.00th=[379.00], 99.50th=[432.00], 99.90th=[706.00]

osd.6:
  op_w kv_commit (μsec): min=97, max=6189, avg=171.62, stdev=125.12, samples=13978
  kv_commit percentiles (μsec):
  |   1.00th=[ 107.00],  5.00th=[ 114.00], 10.00th=[ 119.00],
  |  20.00th=[ 127.00], 30.00th=[ 133.00], 40.00th=[ 140.00],
  |  50.00th=[ 147.00], 60.00th=[ 156.00], 70.00th=[ 170.00],
  |  80.00th=[ 196.00], 90.00th=[ 238.00], 95.00th=[ 278.00],
  |  99.00th=[ 486.00], 99.50th=[ 774.00], 99.90th=[1342.00]

  subop_w kv_commit (μsec): min=91, max=5162, avg=175.88, stdev=127.37, samples=35912
  kv_commit percentiles (μsec):
  |   1.00th=[ 106.00],  5.00th=[ 113.00], 10.00th=[ 119.00],
  |  20.00th=[ 126.00], 30.00th=[ 133.00], 40.00th=[ 140.00],
  |  50.00th=[ 149.00], 60.00th=[ 159.00], 70.00th=[ 175.00],
  |  80.00th=[ 204.00], 90.00th=[ 246.00], 95.00th=[ 294.00],
  |  99.00th=[ 561.00], 99.50th=[ 817.00], 99.90th=[1381.00]

osd.53:
  op_w kv_commit (μsec): min=129, max=2229, avg=433.21, stdev=339.53, samples=1419
  kv_commit percentiles (μsec):
  |   1.00th=[ 146.00],  5.00th=[ 180.00], 10.00th=[ 195.00],
  |  20.00th=[ 215.00], 30.00th=[ 241.00], 40.00th=[ 278.00],
  |  50.00th=[ 307.00], 60.00th=[ 352.00], 70.00th=[ 444.00],
  |  80.00th=[ 596.00], 90.00th=[ 807.00], 95.00th=[1009.00],
  |  99.00th=[2079.00], 99.50th=[2133.00], 99.90th=[2196.00]

  subop_w kv_commit (μsec): min=144, max=3262, avg=353.19, stdev=272.36, samples=3193
  kv_commit percentiles (μsec):
  |   1.00th=[ 168.00],  5.00th=[ 184.00], 10.00th=[ 195.00],
  |  20.00th=[ 211.00], 30.00th=[ 230.00], 40.00th=[ 256.00],
  |  50.00th=[ 286.00], 60.00th=[ 313.00], 70.00th=[ 354.00],
  |  80.00th=[ 418.00], 90.00th=[ 547.00], 95.00th=[ 676.00],
  |  99.00th=[1778.00], 99.50th=[2221.00], 99.90th=[3039.00]

osd.93:
  op_w kv_commit (μsec): min=164, max=7400, avg=429.21, stdev=360.68, samples=1814
  kv_commit percentiles (μsec):
  |   1.00th=[ 179.00],  5.00th=[ 193.00], 10.00th=[ 205.00],
  |  20.00th=[ 226.00], 30.00th=[ 255.00], 40.00th=[ 286.00],
  |  50.00th=[ 320.00], 60.00th=[ 370.00], 70.00th=[ 460.00],
  |  80.00th=[ 555.00], 90.00th=[ 694.00], 95.00th=[ 905.00],
  |  99.00th=[1843.00], 99.50th=[2246.00], 99.90th=[3164.00]

  subop_w kv_commit (μsec): min=134, max=4155, avg=406.34, stdev=427.80, samples=3658
  kv_commit percentiles (μsec):
  |   1.00th=[ 169.00],  5.00th=[ 185.00], 10.00th=[ 197.00],
  |  20.00th=[ 218.00], 30.00th=[ 244.00], 40.00th=[ 275.00],
  |  50.00th=[ 302.00], 60.00th=[ 331.00], 70.00th=[ 378.00],
  |  80.00th=[ 453.00], 90.00th=[ 593.00], 95.00th=[ 869.00],
  |  99.00th=[2397.00], 99.50th=[4136.00], 99.90th=[4152.00]

osd.61:
  op_w kv_commit (μsec): min=156, max=6380, avg=372.35, stdev=362.56, samples=2856
  kv_commit percentiles (μsec):
  |   1.00th=[ 169.00],  5.00th=[ 183.00], 10.00th=[ 192.00],
  |  20.00th=[ 210.00], 30.00th=[ 227.00], 40.00th=[ 255.00],
  |  50.00th=[ 285.00], 60.00th=[ 312.00], 70.00th=[ 346.00],
  |  80.00th=[ 419.00], 90.00th=[ 607.00], 95.00th=[ 804.00],
  |  99.00th=[1953.00], 99.50th=[2149.00], 99.90th=[6362.00]

  subop_w kv_commit (μsec): min=149, max=5631, avg=446.23, stdev=467.06, samples=1312
  kv_commit percentiles (μsec):
  |   1.00th=[ 167.00],  5.00th=[ 190.00], 10.00th=[ 205.00],
  |  20.00th=[ 235.00], 30.00th=[ 268.00], 40.00th=[ 301.00],
  |  50.00th=[ 330.00], 60.00th=[ 369.00], 70.00th=[ 430.00],
  |  80.00th=[ 508.00], 90.00th=[ 697.00], 95.00th=[1027.00],
  |  99.00th=[2167.00], 99.50th=[4117.00], 99.90th=[5539.00]

osd.150:
  op_w kv_commit (μsec): min=171, max=2630, avg=455.73, stdev=287.03, samples=1268
  kv_commit percentiles (μsec):
  |   1.00th=[ 183.00],  5.00th=[ 203.00], 10.00th=[ 216.00],
  |  20.00th=[ 241.00], 30.00th=[ 282.00], 40.00th=[ 324.00],
  |  50.00th=[ 372.00], 60.00th=[ 452.00], 70.00th=[ 523.00],
  |  80.00th=[ 600.00], 90.00th=[ 722.00], 95.00th=[1019.00],
  |  99.00th=[1484.00], 99.50th=[2051.00], 99.90th=[2523.00]

  subop_w kv_commit (μsec): min=140, max=7377, avg=437.60, stdev=430.49, samples=2972
  kv_commit percentiles (μsec):
  |   1.00th=[ 176.00],  5.00th=[ 195.00], 10.00th=[ 208.00],
  |  20.00th=[ 231.00], 30.00th=[ 255.00], 40.00th=[ 288.00],
  |  50.00th=[ 319.00], 60.00th=[ 363.00], 70.00th=[ 427.00],
  |  80.00th=[ 524.00], 90.00th=[ 710.00], 95.00th=[1052.00],
  |  99.00th=[2514.00], 99.50th=[2917.00], 99.90th=[7096.00]

"""

GOLDEN_RECV_LAT_OUTPUT = """osd.31:
  op_r recv_lat (μsec): min=0, max=192, avg=4.19, stdev=4.69, samples=4945
  recv_lat percentiles (μsec):
  |   1.00th=[ 1.00],  5.00th=[ 1.00], 10.00th=[ 2.00],
  |  20.00th=[ 2.00], 30.00th=[ 3.00], 40.00th=[ 3.00],
  |  50.00th=[ 4.00], 60.00th=[ 4.00], 70.00th=[ 4.00],
  |  80.00th=[ 5.00], 90.00th=[ 7.00], 95.00th=[ 8.00],
  |  99.00th=[14.00], 99.50th=[18.00], 99.90th=[46.00]

  op_w recv_lat (μsec): min=1, max=6261, avg=78.90, stdev=372.20, samples=17553
  recv_lat percentiles (μsec):
  |   1.00th=[   3.00],  5.00th=[   5.00], 10.00th=[   6.00],
  |  20.00th=[   7.00], 30.00th=[   7.00], 40.00th=[   9.00],
  |  50.00th=[  10.00], 60.00th=[  13.00], 70.00th=[  16.00],
  |  80.00th=[  22.00], 90.00th=[  41.00], 95.00th=[ 152.00],
  |  99.00th=[1957.00], 99.50th=[2859.00], 99.90th=[4677.00]

  subop_w recv_lat (μsec): min=2, max=7218, avg=74.18, stdev=361.30, samples=32665
  recv_lat percentiles (μsec):
  |   1.00th=[   3.00],  5.00th=[   6.00], 10.00th=[   7.00],
  |  20.00th=[   9.00], 30.00th=[  11.00], 40.00th=[  13.00],
  |  50.00th=[  15.00], 60.00th=[  17.00], 70.00th=[  19.00],
  |  80.00th=[  23.00], 90.00th=[  37.00], 95.00th=[  96.00],
  |  99.00th=[1899.00], 99.50th=[2927.00], 99.90th=[4468.00]

osd.6:
  op_r recv_lat (μsec): min=1, max=121, avg=4.33, stdev=3.19, samples=3298
  recv_lat percentiles (μsec):
  |   1.00th=[ 1.00],  5.00th=[ 2.00], 10.00th=[ 2.00],
  |  20.00th=[ 3.00], 30.00th=[ 3.00], 40.00th=[ 4.00],
  |  50.00th=[ 4.00], 60.00th=[ 4.00], 70.00th=[ 5.00],
  |  80.00th=[ 5.00], 90.00th=[ 6.00], 95.00th=[ 8.00],
  |  99.00th=[13.00], 99.50th=[20.00], 99.90th=[30.00]

  op_w recv_lat (μsec): min=1, max=6560, avg=54.86, stdev=273.11, samples=13978
  recv_lat percentiles (μsec):
  |   1.00th=[   3.00],  5.00th=[   5.00], 10.00th=[   5.00],
  |  20.00th=[   6.00], 30.00th=[   7.00], 40.00th=[   8.00],
  |  50.00th=[   9.00], 60.00th=[  11.00], 70.00th=[  13.00],
  |  80.00th=[  16.00], 90.00th=[  27.00], 95.00th=[  73.00],
  |  99.00th=[1424.00], 99.50th=[1937.00], 99.90th=[3170.00]

  subop_w recv_lat (μsec): min=2, max=7601, avg=55.42, stdev=259.67, samples=35912
  recv_lat percentiles (μsec):
  |   1.00th=[   3.00],  5.00th=[   5.00], 10.00th=[   6.00],
  |  20.00th=[   8.00], 30.00th=[  10.00], 40.00th=[  11.00],
  |  50.00th=[  13.00], 60.00th=[  14.00], 70.00th=[  16.00],
  |  80.00th=[  20.00], 90.00th=[  30.00], 95.00th=[  71.00],
  |  99.00th=[1380.00], 99.50th=[1919.00], 99.90th=[3292.00]

osd.53:
  op_r recv_lat (μsec): min=0, max=20, avg=3.87, stdev=2.31, samples=780
  recv_lat percentiles (μsec):
  |   1.00th=[ 1.00],  5.00th=[ 1.00], 10.00th=[ 1.00],
  |  20.00th=[ 2.00], 30.00th=[ 3.00], 40.00th=[ 3.00],
  |  50.00th=[ 4.00], 60.00th=[ 4.00], 70.00th=[ 5.00],
  |  80.00th=[ 5.00], 90.00th=[ 6.00], 95.00th=[ 8.00],
  |  99.00th=[13.00], 99.50th=[16.00], 99.90th=[20.00]

  op_w recv_lat (μsec): min=1, max=1486, avg=16.71, stdev=66.61, samples=1419
  recv_lat percentiles (μsec):
  |   1.00th=[   2.00],  5.00th=[   3.00], 10.00th=[   4.00],
  |  20.00th=[   4.00], 30.00th=[   5.00], 40.00th=[   6.00],
  |  50.00th=[   7.00], 60.00th=[   9.00], 70.00th=[  12.00],
  |  80.00th=[  15.00], 90.00th=[  24.00], 95.00th=[  38.00],
  |  99.00th=[ 161.00], 99.50th=[ 417.00], 99.90th=[1228.00]

  subop_w recv_lat (μsec): min=2, max=2019, avg=21.02, stdev=79.86, samples=3193
  recv_lat percentiles (μsec):
  |   1.00th=[   4.00],  5.00th=[   5.00], 10.00th=[   5.00],
  |  20.00th=[   6.00], 30.00th=[   8.00], 40.00th=[  10.00],
  |  50.00th=[  11.00], 60.00th=[  13.00], 70.00th=[  15.00],
  |  80.00th=[  19.00], 90.00th=[  26.00], 95.00th=[  37.00],
  |  99.00th=[ 211.00], 99.50th=[ 593.00], 99.90th=[1197.00]

osd.93:
  op_r recv_lat (μsec): min=0, max=39, avg=3.84, stdev=2.38, samples=1008
  recv_lat percentiles (μsec):
  |   1.00th=[ 1.00],  5.00th=[ 1.00], 10.00th=[ 2.00],
  |  20.00th=[ 2.00], 30.00th=[ 3.00], 40.00th=[ 3.00],
  |  50.00th=[ 3.00], 60.00th=[ 4.00], 70.00th=[ 4.00],
  |  80.00th=[ 5.00], 90.00th=[ 6.00], 95.00th=[ 7.00],
  |  99.00th=[11.00], 99.50th=[15.00], 99.90th=[23.00]

  op_w recv_lat (μsec): min=2, max=2266, avg=16.95, stdev=81.25, samples=1814
  recv_lat percentiles (μsec):
  |   1.00th=[   3.00],  5.00th=[   4.00], 10.00th=[   4.00],
  |  20.00th=[   5.00], 30.00th=[   6.00], 40.00th=[   7.00],
  |  50.00th=[   8.00], 60.00th=[  10.00], 70.00th=[  12.00],
  |  80.00th=[  15.00], 90.00th=[  21.00], 95.00th=[  33.00],
  |  99.00th=[ 120.00], 99.50th=[ 248.00], 99.90th=[1657.00]

  subop_w recv_lat (μsec): min=2, max=3096, avg=24.09, stdev=129.41, samples=3658
  recv_lat percentiles (μsec):
  |   1.00th=[   4.00],  5.00th=[   5.00], 10.00th=[   5.00],
  |  20.00th=[   6.00], 30.00th=[   7.00], 40.00th=[   8.00],
  |  50.00th=[  10.00], 60.00th=[  12.00], 70.00th=[  13.00],
  |  80.00th=[  15.00], 90.00th=[  21.00], 95.00th=[  29.00],
  |  99.00th=[ 429.00], 99.50th=[1006.00], 99.90th=[2051.00]

osd.61:
  op_r recv_lat (μsec): min=1, max=50, avg=5.22, stdev=3.50, samples=1384
  recv_lat percentiles (μsec):
  |   1.00th=[ 1.00],  5.00th=[ 2.00], 10.00th=[ 2.00],
  |  20.00th=[ 3.00], 30.00th=[ 4.00], 40.00th=[ 4.00],
  |  50.00th=[ 5.00], 60.00th=[ 5.00], 70.00th=[ 6.00],
  |  80.00th=[ 7.00], 90.00th=[ 8.00], 95.00th=[10.00],
  |  99.00th=[19.00], 99.50th=[24.00], 99.90th=[45.00]

  op_w recv_lat (μsec): min=2, max=4941, avg=24.27, stdev=139.14, samples=2856
  recv_lat percentiles (μsec):
  |   1.00th=[   4.00],  5.00th=[   5.00], 10.00th=[   5.00],
  |  20.00th=[   6.00], 30.00th=[   7.00], 40.00th=[   8.00],
  |  50.00th=[  10.00], 60.00th=[  11.00], 70.00th=[  14.00],
  |  80.00th=[  17.00], 90.00th=[  25.00], 95.00th=[  39.00],
  |  99.00th=[ 205.00], 99.50th=[ 895.00], 99.90th=[1567.00]

  subop_w recv_lat (μsec): min=2, max=4004, avg=23.24, stdev=135.24, samples=1312
  recv_lat percentiles (μsec):
  |   1.00th=[   5.00],  5.00th=[   6.00], 10.00th=[   6.00],
  |  20.00th=[   7.00], 30.00th=[   8.00], 40.00th=[  10.00],
  |  50.00th=[  11.00], 60.00th=[  13.00], 70.00th=[  16.00],
  |  80.00th=[  20.00], 90.00th=[  28.00], 95.00th=[  38.00],
  |  99.00th=[ 143.00], 99.50th=[ 258.00], 99.90th=[1779.00]

osd.150:
  op_r recv_lat (μsec): min=1, max=18, avg=4.09, stdev=2.37, samples=698
  recv_lat percentiles (μsec):
  |   1.00th=[ 1.00],  5.00th=[ 1.00], 10.00th=[ 2.00],
  |  20.00th=[ 2.00], 30.00th=[ 3.00], 40.00th=[ 3.00],
  |  50.00th=[ 4.00], 60.00th=[ 4.00], 70.00th=[ 5.00],
  |  80.00th=[ 5.00], 90.00th=[ 7.00], 95.00th=[ 8.00],
  |  99.00th=[15.00], 99.50th=[17.00], 99.90th=[18.00]

  op_w recv_lat (μsec): min=3, max=2083, avg=20.54, stdev=112.59, samples=1268
  recv_lat percentiles (μsec):
  |   1.00th=[   3.00],  5.00th=[   4.00], 10.00th=[   4.00],
  |  20.00th=[   5.00], 30.00th=[   5.00], 40.00th=[   6.00],
  |  50.00th=[   7.00], 60.00th=[   8.00], 70.00th=[   9.00],
  |  80.00th=[  11.00], 90.00th=[  16.00], 95.00th=[  25.00],
  |  99.00th=[ 416.00], 99.50th=[ 633.00], 99.90th=[1638.00]

  subop_w recv_lat (μsec): min=2, max=1751, avg=25.87, stdev=115.06, samples=2972
  recv_lat percentiles (μsec):
  |   1.00th=[   4.00],  5.00th=[   4.00], 10.00th=[   5.00],
  |  20.00th=[   5.00], 30.00th=[   6.00], 40.00th=[   7.00],
  |  50.00th=[   9.00], 60.00th=[  11.00], 70.00th=[  13.00],
  |  80.00th=[  15.00], 90.00th=[  20.00], 95.00th=[  32.00],
  |  99.00th=[ 608.00], 99.50th=[ 981.00], 99.90th=[1503.00]

"""

GOLDEN_INFER_OUTPUT = f"""osd.31:
  op_r:
    45.01% from bluestore_lat
    25.87% from queue_lat
     9.29% from osd_lat
     2.63% from dispatch_lat
     1.75% from recv_lat
     0.21% from throttle_lat
  subop_w:
    64.36% from bluestore_lat
    10.85% from queue_lat
     8.32% from osd_lat
     4.81% from recv_lat
     1.29% from dispatch_lat
     0.04% from throttle_lat
  op_w:
    25.17% from bluestore_lat
    11.88% from queue_lat
     9.66% from osd_lat
     2.05% from recv_lat
     0.45% from dispatch_lat
     0.04% from throttle_lat

osd.6:
  op_r:
    45.57% from bluestore_lat
    19.96% from queue_lat
     8.76% from osd_lat
     2.78% from dispatch_lat
     1.82% from recv_lat
     0.28% from throttle_lat
  subop_w:
    65.69% from bluestore_lat
    10.23% from queue_lat
     7.90% from osd_lat
     3.81% from recv_lat
     1.24% from dispatch_lat
     0.02% from throttle_lat
  op_w:
    26.70% from bluestore_lat
    10.23% from queue_lat
     9.95% from osd_lat
     1.59% from recv_lat
     0.48% from dispatch_lat
     0.06% from throttle_lat

osd.53:
  subop_w:
    80.99% from bluestore_lat
     5.72% from queue_lat
     5.35% from osd_lat
     2.13% from recv_lat
     0.87% from dispatch_lat
     0.01% from throttle_lat
  op_w:
    40.81% from bluestore_lat
    12.34% from queue_lat
     6.56% from osd_lat
     0.75% from recv_lat
     0.30% from dispatch_lat
     0.01% from throttle_lat
  op_r:
    57.82% from bluestore_lat
    24.36% from queue_lat
     9.06% from osd_lat
     2.43% from dispatch_lat
     1.45% from recv_lat
     0.15% from throttle_lat

osd.93:
  op_r:
    62.73% from bluestore_lat
    20.39% from queue_lat
     9.27% from osd_lat
     2.07% from dispatch_lat
     1.33% from recv_lat
     0.15% from throttle_lat
  subop_w:
    82.20% from bluestore_lat
     5.46% from queue_lat
     5.24% from osd_lat
     1.81% from recv_lat
     0.78% from dispatch_lat
     0.01% from throttle_lat
  op_w:
    42.09% from bluestore_lat
     9.56% from queue_lat
     6.18% from osd_lat
     0.69% from recv_lat
     0.28% from dispatch_lat
     0.02% from throttle_lat

osd.61:
  subop_w:
    78.86% from bluestore_lat
     7.81% from queue_lat
     5.27% from osd_lat
     1.90% from recv_lat
     0.88% from dispatch_lat
     0.02% from throttle_lat
  op_w:
    39.05% from bluestore_lat
     6.95% from osd_lat
     6.70% from queue_lat
     0.89% from recv_lat
     0.42% from dispatch_lat
     0.03% from throttle_lat
  op_r:
    59.27% from bluestore_lat
    21.22% from queue_lat
     9.21% from osd_lat
     2.86% from dispatch_lat
     1.77% from recv_lat
     0.28% from throttle_lat

osd.150:
  op_r:
    58.73% from bluestore_lat
    21.49% from queue_lat
     9.01% from osd_lat
     2.37% from dispatch_lat
     1.40% from recv_lat
     0.18% from throttle_lat
  subop_w:
    78.78% from bluestore_lat
     7.32% from queue_lat
     4.68% from osd_lat
     1.66% from recv_lat
     0.72% from dispatch_lat
     0.01% from throttle_lat
  op_w:
    30.55% from bluestore_lat
     8.56% from queue_lat
     4.18% from osd_lat
     0.42% from recv_lat
     0.19% from dispatch_lat
     0.01% from throttle_lat

"""

GOLDEN_SORTED_OUTPUT_LAST_3_LINES = """
osd 150 pg 22.160 op op_w size 4096 client 204434826 tid 14760815 throttle_lat 1 recv_lat 8 dispatch_lat 6 queue_lat 31 osd_lat 117 peers [(87, 902463), (153, 955)] bluestore_lat 538 (prepare 47 aio_wait 175 aio_size 1 seq_wait 5 kv_commit 309) lat_type op_lat lat 902616
osd 150 pg 22.3c op op_w size 4096 client 237181702 tid 12899038 throttle_lat 1 recv_lat 8 dispatch_lat 5 queue_lat 24 osd_lat 99 peers [(74, 1093), (113, 941689)] bluestore_lat 486 (prepare 35 aio_wait 183 aio_size 1 seq_wait 6 kv_commit 260) lat_type op_lat lat 941815
osd 150 pg 22.3c op op_w size 4096 client 196603652 tid 289352745 throttle_lat 1 recv_lat 6 dispatch_lat 6 queue_lat 37 osd_lat 158 peers [(74, 3850), (113, 1039606)] bluestore_lat 1084 (prepare 77 aio_wait 728 aio_size 1 seq_wait 4 kv_commit 274) lat_type op_lat lat 1039793
"""
