GOLDEN_OUTPUT = """osd.31:
  op_r lat (μsec): min=62, max=17487, avg=475.04, stdev=777.34, samples=5465
  lat percentiles (μsec):
  |   1.00th=[   74.00],  5.00th=[   88.00], 10.00th=[  101.00],
  |  20.00th=[  146.00], 30.00th=[  229.00], 40.00th=[  245.00],
  |  50.00th=[  263.00], 60.00th=[  290.00], 70.00th=[  346.00],
  |  80.00th=[  632.00], 90.00th=[ 1092.00], 95.00th=[ 1465.00],
  |  99.00th=[ 2893.00], 99.50th=[ 3946.00], 99.90th=[15891.00]

  op_w lat (μsec): min=534, max=454649, avg=2937.40, stdev=17831.79, samples=19458
  lat percentiles (μsec):
  |   1.00th=[   670.00],  5.00th=[   756.00], 10.00th=[   817.00],
  |  20.00th=[   906.00], 30.00th=[   981.00], 40.00th=[  1063.00],
  |  50.00th=[  1173.00], 60.00th=[  1331.00], 70.00th=[  1620.00],
  |  80.00th=[  2382.00], 90.00th=[  4426.00], 95.00th=[  6829.00],
  |  99.00th=[ 15531.00], 99.50th=[ 19293.00], 99.90th=[385932.00]

  subop_w lat (μsec): min=200, max=21635, avg=747.93, stdev=1321.10, samples=36672
  lat percentiles (μsec):
  |   1.00th=[  268.00],  5.00th=[  292.00], 10.00th=[  308.00],
  |  20.00th=[  332.00], 30.00th=[  355.00], 40.00th=[  380.00],
  |  50.00th=[  411.00], 60.00th=[  453.00], 70.00th=[  513.00],
  |  80.00th=[  613.00], 90.00th=[ 1071.00], 95.00th=[ 2435.00],
  |  99.00th=[ 7817.00], 99.50th=[10039.00], 99.90th=[13544.00]

osd.6:
  op_r lat (μsec): min=62, max=27131, avg=433.44, stdev=819.97, samples=3749
  lat percentiles (μsec):
  |   1.00th=[  76.00],  5.00th=[  86.00], 10.00th=[  97.00],
  |  20.00th=[ 140.00], 30.00th=[ 234.00], 40.00th=[ 249.00],
  |  50.00th=[ 263.00], 60.00th=[ 280.00], 70.00th=[ 320.00],
  |  80.00th=[ 463.00], 90.00th=[ 982.00], 95.00th=[1232.00],
  |  99.00th=[2504.00], 99.50th=[4137.00], 99.90th=[8855.00]

  op_w lat (μsec): min=536, max=669993, avg=2269.12, stdev=10076.25, samples=15897
  lat percentiles (μsec):
  |   1.00th=[  652.00],  5.00th=[  737.00], 10.00th=[  793.00],
  |  20.00th=[  878.00], 30.00th=[  952.00], 40.00th=[ 1031.00],
  |  50.00th=[ 1132.00], 60.00th=[ 1281.00], 70.00th=[ 1563.00],
  |  80.00th=[ 2279.00], 90.00th=[ 4363.00], 95.00th=[ 6947.00],
  |  99.00th=[15986.00], 99.50th=[22632.00], 99.90th=[29546.00]

  subop_w lat (μsec): min=183, max=25210, avg=744.26, stdev=1208.19, samples=40137
  lat percentiles (μsec):
  |   1.00th=[  276.00],  5.00th=[  306.00], 10.00th=[  324.00],
  |  20.00th=[  352.00], 30.00th=[  379.00], 40.00th=[  406.00],
  |  50.00th=[  437.00], 60.00th=[  477.00], 70.00th=[  533.00],
  |  80.00th=[  640.00], 90.00th=[ 1075.00], 95.00th=[ 2308.00],
  |  99.00th=[ 7308.00], 99.50th=[ 9218.00], 99.90th=[12213.00]

osd.150:
  op_r lat (μsec): min=57, max=370943, avg=6299.02, stdev=25107.53, samples=768
  lat percentiles (μsec):
  |   1.00th=[    72.00],  5.00th=[    89.00], 10.00th=[   110.00],
  |  20.00th=[   250.00], 30.00th=[   272.00], 40.00th=[   288.00],
  |  50.00th=[   309.00], 60.00th=[   335.00], 70.00th=[   380.00],
  |  80.00th=[   733.00], 90.00th=[ 11604.00], 95.00th=[ 41383.00],
  |  99.00th=[112445.00], 99.50th=[184253.00], 99.90th=[370943.00]

  op_w lat (μsec): min=886, max=1039793, avg=74201.37, stdev=161576.02, samples=1459
  lat percentiles (μsec):
  |   1.00th=[  1017.00],  5.00th=[  1175.00], 10.00th=[  1323.00],
  |  20.00th=[  1566.00], 30.00th=[  1787.00], 40.00th=[  2069.00],
  |  50.00th=[  2521.00], 60.00th=[  3358.00], 70.00th=[  5598.00],
  |  80.00th=[102184.00], 90.00th=[302186.00], 95.00th=[452362.00],
  |  99.00th=[670991.00], 99.50th=[782395.00], 99.90th=[941815.00]

  subop_w lat (μsec): min=243, max=163564, avg=2265.55, stdev=8799.15, samples=3287
  lat percentiles (μsec):
  |   1.00th=[  373.00],  5.00th=[  485.00], 10.00th=[  524.00],
  |  20.00th=[  585.00], 30.00th=[  632.00], 40.00th=[  685.00],
  |  50.00th=[  750.00], 60.00th=[  840.00], 70.00th=[  968.00],
  |  80.00th=[ 1283.00], 90.00th=[ 2621.00], 95.00th=[ 5807.00],
  |  99.00th=[61917.00], 99.50th=[69958.00], 99.90th=[91980.00]

osd.93:
  op_r lat (μsec): min=61, max=43990, avg=969.32, stdev=3099.22, samples=1135
  lat percentiles (μsec):
  |   1.00th=[   73.00],  5.00th=[  114.00], 10.00th=[  236.00],
  |  20.00th=[  258.00], 30.00th=[  274.00], 40.00th=[  286.00],
  |  50.00th=[  303.00], 60.00th=[  332.00], 70.00th=[  365.00],
  |  80.00th=[  446.00], 90.00th=[ 1297.00], 95.00th=[ 2015.00],
  |  99.00th=[17274.00], 99.50th=[21915.00], 99.90th=[25667.00]

  op_w lat (μsec): min=793, max=461976, avg=2696.40, stdev=10426.67, samples=2001
  lat percentiles (μsec):
  |   1.00th=[  956.00],  5.00th=[ 1125.00], 10.00th=[ 1224.00],
  |  20.00th=[ 1384.00], 30.00th=[ 1526.00], 40.00th=[ 1656.00],
  |  50.00th=[ 1845.00], 60.00th=[ 2147.00], 70.00th=[ 2634.00],
  |  80.00th=[ 3336.00], 90.00th=[ 4406.00], 95.00th=[ 5224.00],
  |  99.00th=[ 9672.00], 99.50th=[13017.00], 99.90th=[20935.00]

  subop_w lat (μsec): min=237, max=12141, avg=952.53, stdev=1009.86, samples=4067
  lat percentiles (μsec):
  |   1.00th=[  386.00],  5.00th=[  458.00], 10.00th=[  490.00],
  |  20.00th=[  546.00], 30.00th=[  598.00], 40.00th=[  650.00],
  |  50.00th=[  703.00], 60.00th=[  765.00], 70.00th=[  845.00],
  |  80.00th=[  979.00], 90.00th=[ 1382.00], 95.00th=[ 2348.00],
  |  99.00th=[ 6104.00], 99.50th=[ 7750.00], 99.90th=[11062.00]

osd.61:
  op_r lat (μsec): min=65, max=13859, avg=446.79, stdev=623.51, samples=1530
  lat percentiles (μsec):
  |   1.00th=[   79.00],  5.00th=[  106.00], 10.00th=[  219.00],
  |  20.00th=[  263.00], 30.00th=[  280.00], 40.00th=[  302.00],
  |  50.00th=[  326.00], 60.00th=[  352.00], 70.00th=[  374.00],
  |  80.00th=[  408.00], 90.00th=[  795.00], 95.00th=[ 1313.00],
  |  99.00th=[ 2135.00], 99.50th=[ 3153.00], 99.90th=[11292.00]

  op_w lat (μsec): min=785, max=583392, avg=2597.78, stdev=11617.89, samples=3231
  lat percentiles (μsec):
  |   1.00th=[   926.00],  5.00th=[  1045.00], 10.00th=[  1133.00],
  |  20.00th=[  1261.00], 30.00th=[  1379.00], 40.00th=[  1489.00],
  |  50.00th=[  1622.00], 60.00th=[  1789.00], 70.00th=[  2039.00],
  |  80.00th=[  2630.00], 90.00th=[  3912.00], 95.00th=[  5345.00],
  |  99.00th=[ 12159.00], 99.50th=[ 14527.00], 99.90th=[104685.00]

  subop_w lat (μsec): min=274, max=12603, avg=1067.35, stdev=859.68, samples=1484
  lat percentiles (μsec):
  |   1.00th=[ 423.00],  5.00th=[ 500.00], 10.00th=[ 543.00],
  |  20.00th=[ 610.00], 30.00th=[ 674.00], 40.00th=[ 724.00],
  |  50.00th=[ 787.00], 60.00th=[ 874.00], 70.00th=[1010.00],
  |  80.00th=[1321.00], 90.00th=[1948.00], 95.00th=[2561.00],
  |  99.00th=[3732.00], 99.50th=[6946.00], 99.90th=[8431.00]

osd.53:
  op_r lat (μsec): min=62, max=40024, avg=1508.96, stdev=4472.56, samples=853
  lat percentiles (μsec):
  |   1.00th=[   71.00],  5.00th=[   91.00], 10.00th=[  113.00],
  |  20.00th=[  245.00], 30.00th=[  265.00], 40.00th=[  284.00],
  |  50.00th=[  304.00], 60.00th=[  341.00], 70.00th=[  390.00],
  |  80.00th=[  703.00], 90.00th=[ 1575.00], 95.00th=[11684.00],
  |  99.00th=[22837.00], 99.50th=[24822.00], 99.90th=[40024.00]

  op_w lat (μsec): min=783, max=67195, avg=2432.71, stdev=2390.12, samples=1580
  lat percentiles (μsec):
  |   1.00th=[  922.00],  5.00th=[ 1039.00], 10.00th=[ 1125.00],
  |  20.00th=[ 1263.00], 30.00th=[ 1370.00], 40.00th=[ 1506.00],
  |  50.00th=[ 1688.00], 60.00th=[ 1945.00], 70.00th=[ 2414.00],
  |  80.00th=[ 3256.00], 90.00th=[ 4994.00], 95.00th=[ 5603.00],
  |  99.00th=[ 8248.00], 99.50th=[10837.00], 99.90th=[21448.00]

  subop_w lat (μsec): min=266, max=15528, avg=866.16, stdev=791.69, samples=3628
  lat percentiles (μsec):
  |   1.00th=[  394.00],  5.00th=[  456.00], 10.00th=[  489.00],
  |  20.00th=[  535.00], 30.00th=[  579.00], 40.00th=[  620.00],
  |  50.00th=[  669.00], 60.00th=[  727.00], 70.00th=[  803.00],
  |  80.00th=[  934.00], 90.00th=[ 1264.00], 95.00th=[ 1936.00],
  |  99.00th=[ 4503.00], 99.50th=[ 5532.00], 99.90th=[10789.00]

"""

GOLDEN_OUTPUT_OSD_6 = """osd.6:
  op_r lat (μsec): min=62, max=27131, avg=433.44, stdev=819.97, samples=3749
  lat percentiles (μsec):
  |   1.00th=[  76.00],  5.00th=[  86.00], 10.00th=[  97.00],
  |  20.00th=[ 140.00], 30.00th=[ 234.00], 40.00th=[ 249.00],
  |  50.00th=[ 263.00], 60.00th=[ 280.00], 70.00th=[ 320.00],
  |  80.00th=[ 463.00], 90.00th=[ 982.00], 95.00th=[1232.00],
  |  99.00th=[2504.00], 99.50th=[4137.00], 99.90th=[8855.00]

  op_w lat (μsec): min=536, max=669993, avg=2269.12, stdev=10076.25, samples=15897
  lat percentiles (μsec):
  |   1.00th=[  652.00],  5.00th=[  737.00], 10.00th=[  793.00],
  |  20.00th=[  878.00], 30.00th=[  952.00], 40.00th=[ 1031.00],
  |  50.00th=[ 1132.00], 60.00th=[ 1281.00], 70.00th=[ 1563.00],
  |  80.00th=[ 2279.00], 90.00th=[ 4363.00], 95.00th=[ 6947.00],
  |  99.00th=[15986.00], 99.50th=[22632.00], 99.90th=[29546.00]

  subop_w lat (μsec): min=183, max=25210, avg=744.26, stdev=1208.19, samples=40137
  lat percentiles (μsec):
  |   1.00th=[  276.00],  5.00th=[  306.00], 10.00th=[  324.00],
  |  20.00th=[  352.00], 30.00th=[  379.00], 40.00th=[  406.00],
  |  50.00th=[  437.00], 60.00th=[  477.00], 70.00th=[  533.00],
  |  80.00th=[  640.00], 90.00th=[ 1075.00], 95.00th=[ 2308.00],
  |  99.00th=[ 7308.00], 99.50th=[ 9218.00], 99.90th=[12213.00]

"""

GOLDEN_OUTPUT_OSD_6_IN_MS = """osd.6:
  op_r lat (msec): min=0.062, max=27.131, avg=0.43, stdev=0.82, samples=3749
  lat percentiles (msec):
  |   1.00th=[0.08],  5.00th=[0.09], 10.00th=[0.10],
  |  20.00th=[0.14], 30.00th=[0.23], 40.00th=[0.25],
  |  50.00th=[0.26], 60.00th=[0.28], 70.00th=[0.32],
  |  80.00th=[0.46], 90.00th=[0.98], 95.00th=[1.23],
  |  99.00th=[2.50], 99.50th=[4.14], 99.90th=[8.86]

  op_w lat (msec): min=0.536, max=669.993, avg=2.27, stdev=10.08, samples=15897
  lat percentiles (msec):
  |   1.00th=[ 0.65],  5.00th=[ 0.74], 10.00th=[ 0.79],
  |  20.00th=[ 0.88], 30.00th=[ 0.95], 40.00th=[ 1.03],
  |  50.00th=[ 1.13], 60.00th=[ 1.28], 70.00th=[ 1.56],
  |  80.00th=[ 2.28], 90.00th=[ 4.36], 95.00th=[ 6.95],
  |  99.00th=[15.99], 99.50th=[22.63], 99.90th=[29.55]

  subop_w lat (msec): min=0.183, max=25.21, avg=0.74, stdev=1.21, samples=40137
  lat percentiles (msec):
  |   1.00th=[ 0.28],  5.00th=[ 0.31], 10.00th=[ 0.32],
  |  20.00th=[ 0.35], 30.00th=[ 0.38], 40.00th=[ 0.41],
  |  50.00th=[ 0.44], 60.00th=[ 0.48], 70.00th=[ 0.53],
  |  80.00th=[ 0.64], 90.00th=[ 1.07], 95.00th=[ 2.31],
  |  99.00th=[ 7.31], 99.50th=[ 9.22], 99.90th=[12.21]

"""

GOLDEN_KV_COMMIT_OUTPUT = """osd.31:
  op_w kv_commit (μsec): min=93, max=3047, avg=161.21, stdev=90.36, samples=19458
  kv_commit percentiles (μsec):
  |   1.00th=[ 101.00],  5.00th=[ 109.00], 10.00th=[ 114.00],
  |  20.00th=[ 121.00], 30.00th=[ 128.00], 40.00th=[ 134.00],
  |  50.00th=[ 141.00], 60.00th=[ 150.00], 70.00th=[ 163.00],
  |  80.00th=[ 189.00], 90.00th=[ 230.00], 95.00th=[ 265.00],
  |  99.00th=[ 383.00], 99.50th=[ 452.00], 99.90th=[1406.00]

  subop_w kv_commit (μsec): min=90, max=3099, avg=162.50, stdev=79.17, samples=36672
  kv_commit percentiles (μsec):
  |   1.00th=[101.00],  5.00th=[109.00], 10.00th=[114.00],
  |  20.00th=[122.00], 30.00th=[128.00], 40.00th=[135.00],
  |  50.00th=[142.00], 60.00th=[152.00], 70.00th=[168.00],
  |  80.00th=[196.00], 90.00th=[234.00], 95.00th=[267.00],
  |  99.00th=[379.00], 99.50th=[432.00], 99.90th=[694.00]

osd.6:
  op_w kv_commit (μsec): min=97, max=6189, avg=172.77, stdev=134.49, samples=15897
  kv_commit percentiles (μsec):
  |   1.00th=[ 108.00],  5.00th=[ 115.00], 10.00th=[ 120.00],
  |  20.00th=[ 127.00], 30.00th=[ 133.00], 40.00th=[ 140.00],
  |  50.00th=[ 147.00], 60.00th=[ 157.00], 70.00th=[ 171.00],
  |  80.00th=[ 198.00], 90.00th=[ 239.00], 95.00th=[ 279.00],
  |  99.00th=[ 471.00], 99.50th=[ 750.00], 99.90th=[1904.00]

  subop_w kv_commit (μsec): min=91, max=5162, avg=176.89, stdev=123.29, samples=40137
  kv_commit percentiles (μsec):
  |   1.00th=[ 106.00],  5.00th=[ 114.00], 10.00th=[ 119.00],
  |  20.00th=[ 127.00], 30.00th=[ 134.00], 40.00th=[ 141.00],
  |  50.00th=[ 150.00], 60.00th=[ 161.00], 70.00th=[ 177.00],
  |  80.00th=[ 207.00], 90.00th=[ 249.00], 95.00th=[ 298.00],
  |  99.00th=[ 534.00], 99.50th=[ 785.00], 99.90th=[1299.00]

osd.150:
  op_w kv_commit (μsec): min=171, max=3255, avg=446.65, stdev=284.21, samples=1459
  kv_commit percentiles (μsec):
  |   1.00th=[ 184.00],  5.00th=[ 204.00], 10.00th=[ 216.00],
  |  20.00th=[ 240.00], 30.00th=[ 277.00], 40.00th=[ 319.00],
  |  50.00th=[ 365.00], 60.00th=[ 434.00], 70.00th=[ 508.00],
  |  80.00th=[ 590.00], 90.00th=[ 708.00], 95.00th=[ 975.00],
  |  99.00th=[1470.00], 99.50th=[2051.00], 99.90th=[2630.00]

  subop_w kv_commit (μsec): min=140, max=7377, avg=431.67, stdev=415.12, samples=3287
  kv_commit percentiles (μsec):
  |   1.00th=[ 176.00],  5.00th=[ 196.00], 10.00th=[ 209.00],
  |  20.00th=[ 231.00], 30.00th=[ 256.00], 40.00th=[ 289.00],
  |  50.00th=[ 319.00], 60.00th=[ 363.00], 70.00th=[ 425.00],
  |  80.00th=[ 519.00], 90.00th=[ 692.00], 95.00th=[ 999.00],
  |  99.00th=[2395.00], 99.50th=[2865.00], 99.90th=[3785.00]

osd.93:
  op_w kv_commit (μsec): min=145, max=7400, avg=446.93, stdev=424.33, samples=2001
  kv_commit percentiles (μsec):
  |   1.00th=[ 179.00],  5.00th=[ 193.00], 10.00th=[ 205.00],
  |  20.00th=[ 229.00], 30.00th=[ 256.00], 40.00th=[ 287.00],
  |  50.00th=[ 322.00], 60.00th=[ 374.00], 70.00th=[ 464.00],
  |  80.00th=[ 560.00], 90.00th=[ 706.00], 95.00th=[ 949.00],
  |  99.00th=[2449.00], 99.50th=[2542.00], 99.90th=[3164.00]

  subop_w kv_commit (μsec): min=134, max=4155, avg=398.27, stdev=409.66, samples=4067
  kv_commit percentiles (μsec):
  |   1.00th=[ 168.00],  5.00th=[ 184.00], 10.00th=[ 196.00],
  |  20.00th=[ 218.00], 30.00th=[ 244.00], 40.00th=[ 274.00],
  |  50.00th=[ 301.00], 60.00th=[ 330.00], 70.00th=[ 375.00],
  |  80.00th=[ 447.00], 90.00th=[ 586.00], 95.00th=[ 823.00],
  |  99.00th=[2367.00], 99.50th=[4134.00], 99.90th=[4151.00]

osd.61:
  op_w kv_commit (μsec): min=156, max=6380, avg=372.61, stdev=359.93, samples=3231
  kv_commit percentiles (μsec):
  |   1.00th=[ 169.00],  5.00th=[ 182.00], 10.00th=[ 192.00],
  |  20.00th=[ 209.00], 30.00th=[ 227.00], 40.00th=[ 254.00],
  |  50.00th=[ 285.00], 60.00th=[ 312.00], 70.00th=[ 347.00],
  |  80.00th=[ 421.00], 90.00th=[ 614.00], 95.00th=[ 817.00],
  |  99.00th=[1953.00], 99.50th=[2203.00], 99.90th=[5935.00]

  subop_w kv_commit (μsec): min=149, max=5631, avg=434.09, stdev=444.46, samples=1484
  kv_commit percentiles (μsec):
  |   1.00th=[ 167.00],  5.00th=[ 189.00], 10.00th=[ 205.00],
  |  20.00th=[ 233.00], 30.00th=[ 263.00], 40.00th=[ 299.00],
  |  50.00th=[ 326.00], 60.00th=[ 366.00], 70.00th=[ 423.00],
  |  80.00th=[ 498.00], 90.00th=[ 680.00], 95.00th=[ 995.00],
  |  99.00th=[2160.00], 99.50th=[3050.00], 99.90th=[5539.00]

osd.53:
  op_w kv_commit (μsec): min=129, max=5535, avg=424.47, stdev=355.94, samples=1580
  kv_commit percentiles (μsec):
  |   1.00th=[ 148.00],  5.00th=[ 181.00], 10.00th=[ 194.00],
  |  20.00th=[ 212.00], 30.00th=[ 236.00], 40.00th=[ 268.00],
  |  50.00th=[ 301.00], 60.00th=[ 341.00], 70.00th=[ 427.00],
  |  80.00th=[ 574.00], 90.00th=[ 792.00], 95.00th=[ 996.00],
  |  99.00th=[2092.00], 99.50th=[2145.00], 99.90th=[2229.00]

  subop_w kv_commit (μsec): min=144, max=3262, avg=348.82, stdev=269.48, samples=3628
  kv_commit percentiles (μsec):
  |   1.00th=[ 169.00],  5.00th=[ 184.00], 10.00th=[ 194.00],
  |  20.00th=[ 211.00], 30.00th=[ 228.00], 40.00th=[ 253.00],
  |  50.00th=[ 284.00], 60.00th=[ 312.00], 70.00th=[ 349.00],
  |  80.00th=[ 411.00], 90.00th=[ 531.00], 95.00th=[ 661.00],
  |  99.00th=[1751.00], 99.50th=[2221.00], 99.90th=[3039.00]

"""


GOLDEN_RECV_LAT_OUTPUT = """osd.31:
  op_r recv_lat (μsec): min=0, max=192, avg=4.16, stdev=4.55, samples=5465
  recv_lat percentiles (μsec):
  |   1.00th=[ 1.00],  5.00th=[ 1.00], 10.00th=[ 2.00],
  |  20.00th=[ 2.00], 30.00th=[ 3.00], 40.00th=[ 3.00],
  |  50.00th=[ 3.00], 60.00th=[ 4.00], 70.00th=[ 4.00],
  |  80.00th=[ 5.00], 90.00th=[ 7.00], 95.00th=[ 8.00],
  |  99.00th=[14.00], 99.50th=[18.00], 99.90th=[43.00]

  op_w recv_lat (μsec): min=1, max=6895, avg=78.33, stdev=375.12, samples=19458
  recv_lat percentiles (μsec):
  |   1.00th=[   3.00],  5.00th=[   5.00], 10.00th=[   6.00],
  |  20.00th=[   7.00], 30.00th=[   7.00], 40.00th=[   9.00],
  |  50.00th=[  10.00], 60.00th=[  13.00], 70.00th=[  16.00],
  |  80.00th=[  22.00], 90.00th=[  40.00], 95.00th=[ 142.00],
  |  99.00th=[1949.00], 99.50th=[2840.00], 99.90th=[4862.00]

  subop_w recv_lat (μsec): min=2, max=11092, avg=74.43, stdev=364.04, samples=36672
  recv_lat percentiles (μsec):
  |   1.00th=[   4.00],  5.00th=[   6.00], 10.00th=[   7.00],
  |  20.00th=[   9.00], 30.00th=[  11.00], 40.00th=[  13.00],
  |  50.00th=[  15.00], 60.00th=[  17.00], 70.00th=[  19.00],
  |  80.00th=[  23.00], 90.00th=[  37.00], 95.00th=[  96.00],
  |  99.00th=[1899.00], 99.50th=[2897.00], 99.90th=[4440.00]

osd.6:
  op_r recv_lat (μsec): min=1, max=121, avg=4.24, stdev=3.06, samples=3749
  recv_lat percentiles (μsec):
  |   1.00th=[ 1.00],  5.00th=[ 2.00], 10.00th=[ 2.00],
  |  20.00th=[ 3.00], 30.00th=[ 3.00], 40.00th=[ 3.00],
  |  50.00th=[ 4.00], 60.00th=[ 4.00], 70.00th=[ 5.00],
  |  80.00th=[ 5.00], 90.00th=[ 6.00], 95.00th=[ 7.00],
  |  99.00th=[13.00], 99.50th=[18.00], 99.90th=[30.00]

  op_w recv_lat (μsec): min=1, max=6560, avg=55.13, stdev=273.46, samples=15897
  recv_lat percentiles (μsec):
  |   1.00th=[   3.00],  5.00th=[   5.00], 10.00th=[   5.00],
  |  20.00th=[   6.00], 30.00th=[   7.00], 40.00th=[   8.00],
  |  50.00th=[   9.00], 60.00th=[  11.00], 70.00th=[  13.00],
  |  80.00th=[  16.00], 90.00th=[  27.00], 95.00th=[  73.00],
  |  99.00th=[1451.00], 99.50th=[1952.00], 99.90th=[3129.00]

  subop_w recv_lat (μsec): min=2, max=7601, avg=55.81, stdev=261.57, samples=40137
  recv_lat percentiles (μsec):
  |   1.00th=[   3.00],  5.00th=[   5.00], 10.00th=[   6.00],
  |  20.00th=[   8.00], 30.00th=[  10.00], 40.00th=[  11.00],
  |  50.00th=[  13.00], 60.00th=[  14.00], 70.00th=[  16.00],
  |  80.00th=[  19.00], 90.00th=[  29.00], 95.00th=[  73.00],
  |  99.00th=[1371.00], 99.50th=[1959.00], 99.90th=[3274.00]

osd.150:
  op_r recv_lat (μsec): min=1, max=18, avg=3.98, stdev=2.33, samples=768
  recv_lat percentiles (μsec):
  |   1.00th=[ 1.00],  5.00th=[ 1.00], 10.00th=[ 2.00],
  |  20.00th=[ 2.00], 30.00th=[ 3.00], 40.00th=[ 3.00],
  |  50.00th=[ 4.00], 60.00th=[ 4.00], 70.00th=[ 5.00],
  |  80.00th=[ 5.00], 90.00th=[ 6.00], 95.00th=[ 8.00],
  |  99.00th=[15.00], 99.50th=[17.00], 99.90th=[18.00]

  op_w recv_lat (μsec): min=3, max=2083, avg=19.24, stdev=106.02, samples=1459
  recv_lat percentiles (μsec):
  |   1.00th=[   3.00],  5.00th=[   4.00], 10.00th=[   4.00],
  |  20.00th=[   5.00], 30.00th=[   5.00], 40.00th=[   6.00],
  |  50.00th=[   7.00], 60.00th=[   8.00], 70.00th=[   9.00],
  |  80.00th=[  11.00], 90.00th=[  15.00], 95.00th=[  24.00],
  |  99.00th=[ 389.00], 99.50th=[ 555.00], 99.90th=[1638.00]

  subop_w recv_lat (μsec): min=2, max=1751, avg=24.61, stdev=110.02, samples=3287
  recv_lat percentiles (μsec):
  |   1.00th=[   4.00],  5.00th=[   4.00], 10.00th=[   5.00],
  |  20.00th=[   5.00], 30.00th=[   6.00], 40.00th=[   7.00],
  |  50.00th=[   9.00], 60.00th=[  11.00], 70.00th=[  13.00],
  |  80.00th=[  15.00], 90.00th=[  20.00], 95.00th=[  30.00],
  |  99.00th=[ 574.00], 99.50th=[ 926.00], 99.90th=[1486.00]

osd.93:
  op_r recv_lat (μsec): min=0, max=39, avg=3.79, stdev=2.31, samples=1135
  recv_lat percentiles (μsec):
  |   1.00th=[ 1.00],  5.00th=[ 1.00], 10.00th=[ 2.00],
  |  20.00th=[ 2.00], 30.00th=[ 3.00], 40.00th=[ 3.00],
  |  50.00th=[ 3.00], 60.00th=[ 4.00], 70.00th=[ 4.00],
  |  80.00th=[ 5.00], 90.00th=[ 6.00], 95.00th=[ 7.00],
  |  99.00th=[11.00], 99.50th=[15.00], 99.90th=[23.00]

  op_w recv_lat (μsec): min=2, max=3270, avg=21.72, stdev=131.09, samples=2001
  recv_lat percentiles (μsec):
  |   1.00th=[   3.00],  5.00th=[   4.00], 10.00th=[   4.00],
  |  20.00th=[   5.00], 30.00th=[   6.00], 40.00th=[   7.00],
  |  50.00th=[   8.00], 60.00th=[  10.00], 70.00th=[  12.00],
  |  80.00th=[  15.00], 90.00th=[  21.00], 95.00th=[  34.00],
  |  99.00th=[ 145.00], 99.50th=[ 528.00], 99.90th=[2266.00]

  subop_w recv_lat (μsec): min=2, max=3096, avg=23.46, stdev=128.98, samples=4067
  recv_lat percentiles (μsec):
  |   1.00th=[   4.00],  5.00th=[   5.00], 10.00th=[   5.00],
  |  20.00th=[   6.00], 30.00th=[   7.00], 40.00th=[   8.00],
  |  50.00th=[  10.00], 60.00th=[  12.00], 70.00th=[  13.00],
  |  80.00th=[  15.00], 90.00th=[  21.00], 95.00th=[  29.00],
  |  99.00th=[ 367.00], 99.50th=[ 948.00], 99.90th=[2051.00]

osd.61:
  op_r recv_lat (μsec): min=1, max=50, avg=5.23, stdev=3.55, samples=1530
  recv_lat percentiles (μsec):
  |   1.00th=[ 1.00],  5.00th=[ 2.00], 10.00th=[ 2.00],
  |  20.00th=[ 3.00], 30.00th=[ 4.00], 40.00th=[ 4.00],
  |  50.00th=[ 5.00], 60.00th=[ 5.00], 70.00th=[ 6.00],
  |  80.00th=[ 6.00], 90.00th=[ 8.00], 95.00th=[10.00],
  |  99.00th=[18.00], 99.50th=[24.00], 99.90th=[45.00]

  op_w recv_lat (μsec): min=2, max=4941, avg=23.98, stdev=138.40, samples=3231
  recv_lat percentiles (μsec):
  |   1.00th=[   4.00],  5.00th=[   5.00], 10.00th=[   5.00],
  |  20.00th=[   6.00], 30.00th=[   7.00], 40.00th=[   8.00],
  |  50.00th=[  10.00], 60.00th=[  11.00], 70.00th=[  14.00],
  |  80.00th=[  17.00], 90.00th=[  25.00], 95.00th=[  38.00],
  |  99.00th=[ 172.00], 99.50th=[ 873.00], 99.90th=[1567.00]

  subop_w recv_lat (μsec): min=2, max=4004, avg=23.30, stdev=127.52, samples=1484
  recv_lat percentiles (μsec):
  |   1.00th=[   5.00],  5.00th=[   6.00], 10.00th=[   6.00],
  |  20.00th=[   8.00], 30.00th=[   9.00], 40.00th=[  10.00],
  |  50.00th=[  12.00], 60.00th=[  14.00], 70.00th=[  17.00],
  |  80.00th=[  21.00], 90.00th=[  29.00], 95.00th=[  41.00],
  |  99.00th=[ 153.00], 99.50th=[ 251.00], 99.90th=[1779.00]

osd.53:
  op_r recv_lat (μsec): min=0, max=20, avg=3.82, stdev=2.26, samples=853
  recv_lat percentiles (μsec):
  |   1.00th=[ 1.00],  5.00th=[ 1.00], 10.00th=[ 1.00],
  |  20.00th=[ 2.00], 30.00th=[ 3.00], 40.00th=[ 3.00],
  |  50.00th=[ 3.00], 60.00th=[ 4.00], 70.00th=[ 4.00],
  |  80.00th=[ 5.00], 90.00th=[ 6.00], 95.00th=[ 8.00],
  |  99.00th=[13.00], 99.50th=[16.00], 99.90th=[20.00]

  op_w recv_lat (μsec): min=1, max=1486, avg=17.53, stdev=72.70, samples=1580
  recv_lat percentiles (μsec):
  |   1.00th=[   2.00],  5.00th=[   3.00], 10.00th=[   4.00],
  |  20.00th=[   4.00], 30.00th=[   5.00], 40.00th=[   6.00],
  |  50.00th=[   7.00], 60.00th=[   9.00], 70.00th=[  12.00],
  |  80.00th=[  15.00], 90.00th=[  24.00], 95.00th=[  39.00],
  |  99.00th=[ 187.00], 99.50th=[ 481.00], 99.90th=[1228.00]

  subop_w recv_lat (μsec): min=2, max=2019, avg=20.67, stdev=81.08, samples=3628
  recv_lat percentiles (μsec):
  |   1.00th=[   4.00],  5.00th=[   5.00], 10.00th=[   5.00],
  |  20.00th=[   6.00], 30.00th=[   8.00], 40.00th=[  10.00],
  |  50.00th=[  11.00], 60.00th=[  13.00], 70.00th=[  15.00],
  |  80.00th=[  19.00], 90.00th=[  26.00], 95.00th=[  36.00],
  |  99.00th=[ 147.00], 99.50th=[ 571.00], 99.90th=[1359.00]

"""

GOLDEN_INFER_OUTPUT = f"""osd.31:
  op_r:
    45.75% from bluestore_lat
    25.15% from queue_lat
     9.24% from osd_lat
     2.64% from dispatch_lat
     1.74% from recv_lat
     0.21% from throttle_lat
  subop_w:
    64.52% from bluestore_lat
    10.76% from queue_lat
     8.32% from osd_lat
     4.83% from recv_lat
     1.30% from dispatch_lat
     0.03% from throttle_lat
  op_w:
    25.07% from bluestore_lat
    12.00% from queue_lat
     9.60% from osd_lat
     2.03% from recv_lat
     0.45% from dispatch_lat
     0.04% from throttle_lat

osd.6:
  op_r:
    46.21% from bluestore_lat
    19.81% from queue_lat
     8.68% from osd_lat
     2.76% from dispatch_lat
     1.79% from recv_lat
     0.27% from throttle_lat
  subop_w:
    65.76% from bluestore_lat
    10.30% from queue_lat
     7.85% from osd_lat
     3.78% from recv_lat
     1.23% from dispatch_lat
     0.02% from throttle_lat
  op_w:
    26.82% from bluestore_lat
    10.09% from queue_lat
     9.93% from osd_lat
     1.58% from recv_lat
     0.48% from dispatch_lat
     0.06% from throttle_lat

osd.150:
  subop_w:
    79.16% from bluestore_lat
     7.11% from queue_lat
     4.71% from osd_lat
     1.64% from recv_lat
     0.72% from dispatch_lat
     0.01% from throttle_lat
  op_r:
    58.31% from bluestore_lat
    21.84% from queue_lat
     8.97% from osd_lat
     2.38% from dispatch_lat
     1.38% from recv_lat
     0.17% from throttle_lat
  op_w:
    30.61% from bluestore_lat
     8.74% from queue_lat
     4.23% from osd_lat
     0.40% from recv_lat
     0.20% from dispatch_lat
     0.01% from throttle_lat

osd.93:
  subop_w:
    82.22% from bluestore_lat
     5.42% from queue_lat
     5.29% from osd_lat
     1.80% from recv_lat
     0.78% from dispatch_lat
     0.01% from throttle_lat
  op_r:
    62.75% from bluestore_lat
    20.41% from queue_lat
     9.27% from osd_lat
     2.07% from dispatch_lat
     1.31% from recv_lat
     0.15% from throttle_lat
  op_w:
    41.96% from bluestore_lat
     9.72% from queue_lat
     6.12% from osd_lat
     0.73% from recv_lat
     0.27% from dispatch_lat
     0.02% from throttle_lat

osd.61:
  subop_w:
    79.17% from bluestore_lat
     7.56% from queue_lat
     5.28% from osd_lat
     2.00% from recv_lat
     0.90% from dispatch_lat
     0.02% from throttle_lat
  op_r:
    59.61% from bluestore_lat
    20.74% from queue_lat
     9.29% from osd_lat
     2.91% from dispatch_lat
     1.79% from recv_lat
     0.28% from throttle_lat
  op_w:
    39.03% from bluestore_lat
     6.95% from osd_lat
     6.80% from queue_lat
     0.88% from recv_lat
     0.42% from dispatch_lat
     0.03% from throttle_lat

osd.53:
  op_r:
    57.96% from bluestore_lat
    23.81% from queue_lat
     9.30% from osd_lat
     2.48% from dispatch_lat
     1.46% from recv_lat
     0.14% from throttle_lat
  subop_w:
    81.18% from bluestore_lat
     5.65% from queue_lat
     5.38% from osd_lat
     2.11% from recv_lat
     0.87% from dispatch_lat
     0.01% from throttle_lat
  op_w:
    40.89% from bluestore_lat
    11.75% from queue_lat
     6.59% from osd_lat
     0.76% from recv_lat
     0.31% from dispatch_lat
     0.01% from throttle_lat

"""

GOLDEN_SORTED_OUTPUT_LAST_3_LINES = """
osd 150 pg 22.160 op op_w size 4096 client 204434826 tid 14760815 throttle_lat 1 recv_lat 8 dispatch_lat 6 queue_lat 31 osd_lat 117 peers [(87, 902463), (153, 955)] bluestore_lat 538 (prepare 47 aio_wait 175 aio_size 1 seq_wait 5 kv_commit 309) lat_type op_lat lat 902616
osd 150 pg 22.3c op op_w size 4096 client 237181702 tid 12899038 throttle_lat 1 recv_lat 8 dispatch_lat 5 queue_lat 24 osd_lat 99 peers [(74, 1093), (113, 941689)] bluestore_lat 486 (prepare 35 aio_wait 183 aio_size 1 seq_wait 6 kv_commit 260) lat_type op_lat lat 941815
osd 150 pg 22.3c op op_w size 4096 client 196603652 tid 289352745 throttle_lat 1 recv_lat 6 dispatch_lat 6 queue_lat 37 osd_lat 158 peers [(74, 3850), (113, 1039606)] bluestore_lat 1084 (prepare 77 aio_wait 728 aio_size 1 seq_wait 4 kv_commit 274) lat_type op_lat lat 1039793
"""
